Revit 2027 API
OverrideGraphicSettings.ProjectionLinePatternId Property
 Id of the projection surface line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ProjectionLinePatternId { get; }
Public ReadOnly Property ProjectionLinePatternId As ElementId
	Get
public:
property ElementId^ ProjectionLinePatternId {
	ElementId^ get ();
}
member ProjectionLinePatternId : ElementId with get
Property Value
ElementId
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace